//SORTEG01  JOB '',CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1     EXEC PGM=SORT
//SYSOUT    DD SYSOUT=*
//SORTIN    DD *
0002ABDULSAMET     AYBAZ          19970928
0001EYMEN          AYBAZ          20150713
//SORTOUT   DD DSN=Z95624.QSAM.BB,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(5,5),RLSE),
//             DCB=(RECFM=FB,LRECL=50)
//SYSIN     DD *
  SORT FIELDS=(1,4,CH,A)
  OUTREC FIELDS=(1,42,DATE1)
/*
